resources/information/technologies/xml/webServices/soap/structure/src/msgAddPerson01.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Body>
        <service:addPersonRequest 
            xmlns:service="http://example.org/hr/webservice"
            xmlns:people="http://example.org/hr/people">
            
            <service:person xsi:type="people:Employee">
                <people:firstName>John</people:firstName>
                <people:lastName>Deere</people:lastName>
                <people:birthDate>1971-06-07</people:birthDate>
                <people:joinDate>2004-01-01</people:joinDate>
                <people:empNo>1337</people:empNo>
            </service:person>
            
        </service:addPersonRequest>
    </soap:Body>
</soap:Envelope>
